print('I\'m hamed from "rad parsina"')
print("Name\tAge\tYear")
print("newline1\nnewline2\nnewline3")
#\t =tab
#\n =newline

###############################################################################
Age = 14
#Age = 30
print(Age)
 
#متغییر با عدد شروع نمیشود
#پایتون به حروف کوچک و بزرگ حساس است
#برای نام متغییر از کلمات کلیدی نمی توان استفاده کرد

#تمرین در کلاس: برنامه ای بنویسید که مساحت دایره ای به شعاع 5 را محاسبه کند

#################################################################################
print(2+3)
print(4-1)
print(2*3)
print(8/4)

#تمرین در کلاس: این عبارت را محاسبه کنید 2+2*2-2/2 

print("َAli" *4)
print("1000000" *10)
print("*" *5)

###################################################################################
#انواع داده
sen = 9

Average = 19.8

name = "nima"

married = False

email = None

####################################################################################
Name = input("please enter your name ")
print(Name)
print("your name is: "+Name)

######################################################################################
#فعالیت منزل
#مشخصات شخصی خود مانند نام و سن و پایه تحصیلی و معدل و نام مدرسه خود به صورت داده تعریف کنید و نمایش دهید
#از کاربر سن را دریافت کنید و سن کاربر را نمایش دهید
#برنامه ای بنویسید که مساحت مربعی به ضلع 4 را محاسبه کند
# برنامه ای بنویسید که اندازه یک ضلع مربع را از کاربر دریافت کند و محیط انرا نمایش دهد
