a = 10
b = 5
javab = a + b
print("the addition of %d and %d is %d" %(a,b,javab))

tavan = a ** b
print("the addition of %d and %d is %d" %(a,b,tavan))

a = 10 + 3
a += 4
print(a)

#فعالیت کلاسی : برنامه بنویسید که عبارت روبرو را نمایش دهد. baghimandeh 10 bar 3 is 1
#فعالیت کلاسی : بصورت فرم مخفف شده 4 مقدار از آ کاهش دهید

x = (10 + (2 * 5))
print(x)
print(x > a)
#############################
g = "4"
h = "6"
result = g + h
print(result) 
#############################
g = int("2")
h = int("8")
result = g + h
###############################
#d = int("2.5")
##############################
yek = int(input("please enter a number :"))
do = int(input("please enter a number :"))
natigeh = yek + do
print(natigeh)
###############################
#فعالیت کلاسی : برنامه ای بنویسید که با دریافت دو عدد از کاربر حاصل ضرب انرا نمایش دهد
#فعالیت کلاسی : برنامه ای بنویسید که با دریافت نام و نام خانوادگی از کاربر ،نام و نام خانوادگی او را در کنار هم نمایش دهد

#######################################################################################
#فعالیت در منزل : برنامه ای بنویسید که با دریافت روز ، ماه و سال از کاربر تاریخ را به فرم روز/ماه/سال نمایش دهد
#فعالیت منزل: برنامه ای بنویسید که با دریافت 5 نمره از کاربر معدل کاربر را محاسبه کند و نمایش دهد
#فعالیت منزل: برنامه ای بنویسید که با دریافت سال تولد کاربر سن او را محاسبه و نمایش دهد
#برنامه ای بنویسید که با دریافت قیمت یک کالا از کاربر 10درصد تخفیف اعمال کند و قیمت باقی مانده را نمایش دهد